import 'package:flutter/material.dart';
class terms extends StatelessWidget {
  const terms({super.key});

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      body:SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.only(top: 40,bottom: 15,right: 7,left: 10),
          child: Container(
            child: Text(
                '''
        كجزء من سياسة الاستخدام المقبول ل اسم الشركة، فإنك توافق على عدم استخدام المعلومات أو الخدمات أو أي جزء آخر من منصة اشحنليلاتخاذ أي إجراء أو إجراءات من شأنها:
        
            ١. تتعارض مع صورة اشحنلي العامة أو النية الحسنة أو السمعة.
        
            ٢. الترويج لأي نشاط أو محتوى غير قانوني، بما في ذلك على سبيل المثال لا الحصر إساءة معاملة الأطفال أو الحيوانات والعنف والاستخدام غير المشروع للمخدرات والشرب دون السن القانونية.
        
            ٣. تنتهك حقوق الطبع والنشر أو براءات الاختراع أو العلامات التجارية أو الأسرار التجارية أو غيرها من حقوق الملكية أو حقوق الدعاية أو الخصوصية الخاصة بنا أو بشركات أخري.
        
            ٤. عدم مشاركة صريحة أو ضمنية أيًا من بياناتك أو أنشطتك أو أسبابك قد أقرناها، دون موافقتنا الخطية المسبقة في كل حالة.
        
            ٥. انتهاك أي قانون أو قانون أو مرسوم أو لائحة معمول بها في البلاد، أو تشجيع أي سلوك يمكن أن يشكل جريمة جنائية أو ينشأ عنه مسؤولية مدنية.
        
            ٦. التشهير أو تشهيرية أو تهديدية أو مضايقة أو اقتحام للخصوصية أو مسيئة أو مؤذية أو كراهية أو تمييزية أو إباحية أو فاحشة.
        
            ٧. إرسال أي سر تجاري أو معلومات أخرى أو معلومات غير عامة عن أي شخص أو شركة أو كيان دون الحصول على إذن بذلك.
        
            ٨. تقييد أو منع أي زائر آخر من استخدام منصة اسم الشركة، بما في ذلك، على سبيل المثال لا الحصر، عن طريق "اختراق" أو تشويه أي جزء من منصة اشحنلي أو تعديل، تتغيير، ترخيص فرعي، ترجمة، بيع، هندسة عكسية، إلغاء ترجمة، أو فك أي جزء من منصة اسم الشركة.
        
            ٩. إزالة أي حقوق نشر أو علامة تجارية أو غيرها من إشعارات حقوق الملكية الواردة في منصة اسم الشركة.
        
            ١٠. الباطن أو البيع أو الإيجار أو التأجير أو النقل أو التنازل عن أو نقل أي حقوق بموجب الشروط إلى أي طرف ثالث، أو الاستغلال التجاري أو الربح بطريقة أخرى من المعلومات أو محتوى منصة اسم الشركة، أو أي جزء منها، بأي شكل من الأشكال، باستثناء ما هو مسموح به صراحة هنا.
        
            ١١. "طباعه" أو "نسخ" أي جزء من منصة اشحنلي دون إذن خطي مسبق منا.
        
            ١٢. توزيع أي فيروس أو فيروس متنقل أو أي ملفات أو نصوص برمجية أو برامج مشابهة أو ضارة.
        
            ١٣. التدخل مع أو تعطل أي خدمات أو معدات بقصد التسبب في حمل زائد أو غير متناسب على البنية التحتية لشركة اشحنلي أو الجهات المرخصة لها أو مورديها.
        
            ١٤. تنطوي على إعداد أو توزيع البريد غير المرغوب فيه أو الرسائل غير المرغوب فيها أو سلسلة الرسائل أو المخططات الهرمية أو غيرها من رسائل البريد الإلكتروني التجارية الضخمة أو غير المرغوب فيها أو تنتهك بأي شكل من الأشكال قانون مكافحة الاعتداء على المواد الإباحية والتسويق غير المسموح بها (كان سبام أكت ٢٠٠٣) أو ما يعادلها، المعمول بها، القانون الأجنبي.
        
          ١٥. استخدام أي روبوت، أو شبكة، أو تطبيق للبحث / استرجاع الموقع، أو أي جهاز أو عملية أخرى يدوية أو أوتوماتيكية لاسترداد أو فهرسة "مخزن البيانات" في منصة اشحنلي أو إعادة إنتاج أو التحايل على أي شكل من الأشكال الهيكل الملاحي أو العرض التقديمي لمنصة اشحنلي أو المحتويات والمصادقة والتدابير الأمنية.
        
            ١٦. تزوير العناوين أو الهويات أو التلاعب بمعرفات الهوية من أجل إخفاء أصل أي إرسال.
        
            ١٧. تنفيذ أي شكل من أشكال مراقبة الشبكة أو تشغيل محلل شبكة أو حزمة بحث أو تقنية أخرى لاعتراض أو فك شفرة أو استخراج أو عرض أي حزم تستخدم للاتصال بين خوادم اشحنلي للنظام الأساسي أو أي بيانات غير مخصصة لك ، الصورة. حصاد أو جمع معلومات حول أي زائر أو أعضاء من منصة اشحنلي دون موافقتهم الصريحة؛ و / أو
        
            ١٨. يحتوي على أي إشارة إلى أو تشبه أي أطراف ثالثة محددة، ما لم يتم الحصول على موافقة من جميع هؤلاء الأفراد وأولياء أمورهم / الوصي القانوني إذا كانوا تحت سن الرشد حسب قانون الدولة..
          '''.replaceAll(RegExp(r"\s+"), " "),style: TextStyle(
              wordSpacing: 1,   fontSize: 20
            ),
                ),),
        ),
      )
      );
  }
}
